---
kind: method
id: M:Autodesk.Revit.DB.ExportDGNSettings.GetDGNExportOptions
source: html/bdbe8341-e660-3e86-0cb5-03bfac3927f7.htm
---
# Autodesk.Revit.DB.ExportDGNSettings.GetDGNExportOptions Method

Gets the options stored in the these settings.

## Syntax (C#)
```csharp
public DGNExportOptions GetDGNExportOptions()
```

## Returns
The options.